RemoteTesterProject/src/Documents/Регистрация/Регистрация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Регистрация</name>
  <attributes>
    <name>ФамилияИмяОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПользователя</name>
    <type>
      <types>EnumRef.ТипыПользователей</types>
    </type>
  </attributes>
</mdclass:Document>

RemoteTesterProject/src/Enums/ТипыПользователей/ТипыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПользователей</name>
  <enumValues>
    <name>Тестировщик</name>
  </enumValues>
  <enumValues>
    <name>УдаленныйТестировщик</name>
  </enumValues>
  <enumValues>
    <name>Заказчик</name>
  </enumValues>
</mdclass:Enum>

RemoteTesterProject/src/Documents/Регистрация/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЛогинУникальный() Тогда
		ДобавитьПользователя();
	Иначе
		Сообщить("Пользователь с таким логином уже зарегистрирован.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЛогинУникальный()
	Результат = Ложь;
	
	ТекущийОбъект = ЭтаФорма.Object;
	Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("Логин", ТекущийОбъект.Логин);
	
	Если Пользователь.Пустая() Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ДобавитьПользователя()
	
	ТекущийОбъект = ЭтаФорма.Object;
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	Пользователь.Наименование = ТекущийОбъект.Логин;
	Пользователь.Логин = ТекущийОбъект.Логин;
	Пользователь.ФамилияИмяОтчество = ТекущийОбъект.ФамилияИмяОтчество;
	Пользователь.ТипПользователя = ТекущийОбъект.ТипПользователя;
	Пользователь.УникальныйИдентификатор = Новый УникальныйИдентификатор();
	
	Если Пользователь.ТипПользователя = Перечисления.ТипыПользователей.Тестировщик Тогда
		ДобавитьТестировщика(Пользователь);
	ИначеЕсли Пользователь.ТипПользователя = Перечисления.ТипыПользователей.УдаленныйТестировщик Тогда
		ДобавитьУдаленногоТестировщика(Пользователь);
	ИначеЕсли Пользователь.ТипПользователя = Перечисления.ТипыПользователей.Заказчик Тогда
		ДобавитьЗаказчика(Пользователь);
	Иначе
		Сообщить("Не верно указан тип пользователя.");
		Возврат;
	КонецЕсли;
		
	Попытка
		Пользователь.Записать();
		Сообщить("Пользователь добавлен.");
	Исключение
		Сообщить("Не удалось добавить пользователя.");
	КонецПопытки
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаказчика(Пользователь)
	//TODO: Реализация
	Структура = Новый Структура(, );
КонецПроцедуры

&НаСервере
Процедура ДобавитьУдаленногоТестировщика(Пользователь)
	//TODO: Реализация
КонецПроцедуры

&НаСервере
Процедура ДобавитьТестировщика(Пользователь)
	//TODO: Реализация
КонецПроцедуры
